{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"outputs": {"model/Sigmoid": {"name": "model/Sigmoid"}}}}, "modelTopology": {"node": [{"name": "model/Placeholder_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/Placeholder_2", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "model/Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "96"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vggish/conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "vggish/conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "vggish/conv3/conv3_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "vggish/fc2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv3/conv3_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "logits/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv3/conv3_2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "vggish/fc2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv3/conv3_2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "vggish/conv4/conv4_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv4/conv4_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/conv4/conv4_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fully_connected/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "100"}]}}}}}, {"name": "vggish/conv4/conv4_2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "model/vggish/Flatten/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "model/vggish/Flatten/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/vggish/Flatten/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "vggish/fc1/fc1_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12288"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "logits/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/fc1/fc1_1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "fully_connected/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "vggish/fc1/fc1_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vggish/fc1/fc1_2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/Reshape", "op": "Reshape", "input": ["model/Placeholder", "model/vggish/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["model/vggish/Reshape", "vggish/conv1/weights", "vggish/conv1/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "model/vggish/pool1/MaxPool", "op": "MaxPool", "input": ["model/vggish/conv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "model/vggish/conv1/Relu", "op": "Relu", "input": ["model/vggish/pool1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["model/vggish/conv1/Relu", "vggish/conv2/weights", "vggish/conv2/biases"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "model/vggish/pool2/MaxPool", "op": "MaxPool", "input": ["model/vggish/conv2/BiasAdd"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/conv2/Relu", "op": "Relu", "input": ["model/vggish/pool2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/conv3/conv3_1/Relu", "op": "_FusedConv2D", "input": ["model/vggish/conv2/Relu", "vggish/conv3/conv3_1/weights", "vggish/conv3/conv3_1/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}}}, {"name": "model/vggish/conv3/conv3_2/BiasAdd", "op": "_FusedConv2D", "input": ["model/vggish/conv3/conv3_1/Relu", "vggish/conv3/conv3_2/weights", "vggish/conv3/conv3_2/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "model/vggish/pool3/MaxPool", "op": "MaxPool", "input": ["model/vggish/conv3/conv3_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "model/vggish/conv3/conv3_2/Relu", "op": "Relu", "input": ["model/vggish/pool3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/conv4/conv4_1/Relu", "op": "_FusedConv2D", "input": ["model/vggish/conv3/conv3_2/Relu", "vggish/conv4/conv4_1/weights", "vggish/conv4/conv4_1/biases"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "model/vggish/conv4/conv4_2/BiasAdd", "op": "_FusedConv2D", "input": ["model/vggish/conv4/conv4_1/Relu", "vggish/conv4/conv4_2/weights", "vggish/conv4/conv4_2/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/pool4/MaxPool", "op": "MaxPool", "input": ["model/vggish/conv4/conv4_2/BiasAdd"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/vggish/conv4/conv4_2/Relu", "op": "Relu", "input": ["model/vggish/pool4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/Flatten/flatten/Shape", "op": "Shape", "input": ["model/vggish/conv4/conv4_2/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/vggish/Flatten/flatten/strided_slice", "op": "StridedSlice", "input": ["model/vggish/Flatten/flatten/Shape", "model/vggish/Flatten/flatten/strided_slice/stack", "model/vggish/Flatten/flatten/strided_slice/stack_1", "model/vggish/Flatten/flatten/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "model/vggish/Flatten/flatten/Reshape/shape", "op": "Pack", "input": ["model/vggish/Flatten/flatten/strided_slice", "model/vggish/Flatten/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "model/vggish/Flatten/flatten/Reshape", "op": "Reshape", "input": ["model/vggish/conv4/conv4_2/Relu", "model/vggish/Flatten/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/vggish/fc1/fc1_1/Relu", "op": "_FusedMatMul", "input": ["model/vggish/Flatten/flatten/Reshape", "vggish/fc1/fc1_1/weights", "vggish/fc1/fc1_1/biases"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "model/vggish/fc1/fc1_2/Relu", "op": "_FusedMatMul", "input": ["model/vggish/fc1/fc1_1/Relu", "vggish/fc1/fc1_2/weights", "vggish/fc1/fc1_2/biases"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "model/vggish/fc2/Relu", "op": "_FusedMatMul", "input": ["model/vggish/fc1/fc1_2/Relu", "vggish/fc2/weights", "vggish/fc2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "model/fully_connected/Relu", "op": "_FusedMatMul", "input": ["model/vggish/fc2/Relu", "fully_connected/weights", "fully_connected/biases"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "model/logits/BiasAdd", "op": "_FusedMatMul", "input": ["model/fully_connected/Relu", "logits/weights", "logits/biases"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "model/Sigmoid", "op": "Sigmoid", "input": ["model/logits/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of69.bin", "group1-shard2of69.bin", "group1-shard3of69.bin", "group1-shard4of69.bin", "group1-shard5of69.bin", "group1-shard6of69.bin", "group1-shard7of69.bin", "group1-shard8of69.bin", "group1-shard9of69.bin", "group1-shard10of69.bin", "group1-shard11of69.bin", "group1-shard12of69.bin", "group1-shard13of69.bin", "group1-shard14of69.bin", "group1-shard15of69.bin", "group1-shard16of69.bin", "group1-shard17of69.bin", "group1-shard18of69.bin", "group1-shard19of69.bin", "group1-shard20of69.bin", "group1-shard21of69.bin", "group1-shard22of69.bin", "group1-shard23of69.bin", "group1-shard24of69.bin", "group1-shard25of69.bin", "group1-shard26of69.bin", "group1-shard27of69.bin", "group1-shard28of69.bin", "group1-shard29of69.bin", "group1-shard30of69.bin", "group1-shard31of69.bin", "group1-shard32of69.bin", "group1-shard33of69.bin", "group1-shard34of69.bin", "group1-shard35of69.bin", "group1-shard36of69.bin", "group1-shard37of69.bin", "group1-shard38of69.bin", "group1-shard39of69.bin", "group1-shard40of69.bin", "group1-shard41of69.bin", "group1-shard42of69.bin", "group1-shard43of69.bin", "group1-shard44of69.bin", "group1-shard45of69.bin", "group1-shard46of69.bin", "group1-shard47of69.bin", "group1-shard48of69.bin", "group1-shard49of69.bin", "group1-shard50of69.bin", "group1-shard51of69.bin", "group1-shard52of69.bin", "group1-shard53of69.bin", "group1-shard54of69.bin", "group1-shard55of69.bin", "group1-shard56of69.bin", "group1-shard57of69.bin", "group1-shard58of69.bin", "group1-shard59of69.bin", "group1-shard60of69.bin", "group1-shard61of69.bin", "group1-shard62of69.bin", "group1-shard63of69.bin", "group1-shard64of69.bin", "group1-shard65of69.bin", "group1-shard66of69.bin", "group1-shard67of69.bin", "group1-shard68of69.bin", "group1-shard69of69.bin"], "weights": [{"name": "model/vggish/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "vggish/conv1/weights", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "vggish/conv1/biases", "shape": [64], "dtype": "float32"}, {"name": "vggish/conv2/weights", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "vggish/conv2/biases", "shape": [128], "dtype": "float32"}, {"name": "vggish/conv3/conv3_1/weights", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "vggish/fc2/weights", "shape": [4096, 128], "dtype": "float32"}, {"name": "vggish/conv3/conv3_1/biases", "shape": [256], "dtype": "float32"}, {"name": "logits/weights", "shape": [100, 8], "dtype": "float32"}, {"name": "vggish/conv3/conv3_2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "vggish/fc2/biases", "shape": [128], "dtype": "float32"}, {"name": "vggish/conv3/conv3_2/biases", "shape": [256], "dtype": "float32"}, {"name": "vggish/conv4/conv4_1/weights", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "vggish/conv4/conv4_1/biases", "shape": [512], "dtype": "float32"}, {"name": "vggish/conv4/conv4_2/weights", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "fully_connected/weights", "shape": [128, 100], "dtype": "float32"}, {"name": "vggish/conv4/conv4_2/biases", "shape": [512], "dtype": "float32"}, {"name": "model/vggish/Flatten/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "model/vggish/Flatten/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "model/vggish/Flatten/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "vggish/fc1/fc1_1/weights", "shape": [12288, 4096], "dtype": "float32"}, {"name": "logits/biases", "shape": [8], "dtype": "float32"}, {"name": "vggish/fc1/fc1_1/biases", "shape": [4096], "dtype": "float32"}, {"name": "fully_connected/biases", "shape": [100], "dtype": "float32"}, {"name": "vggish/fc1/fc1_2/weights", "shape": [4096, 4096], "dtype": "float32"}, {"name": "vggish/fc1/fc1_2/biases", "shape": [4096], "dtype": "float32"}]}]}