{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"outputs": {"model/Sigmoid": {"name": "model/Sigmoid"}}}}, "modelTopology": {"node": [{"name": "model/Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "model/Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "187"}, {"size": "96"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "1CNN/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_1/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "1CNN/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "2CNN/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "2CNN/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "model/batch_normalization_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "3CNN/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "3CNN/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "4CNN/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "4CNN/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "model/batch_normalization/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "5CNN/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "5CNN/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "model/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "model/flatten/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "model/flatten/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "model/batch_normalization_5/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_5/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "model/batch_normalization_4/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "model/batch_normalization_3/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_3/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_2/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "model/ExpandDims", "op": "ExpandDims", "input": ["model/Placeholder", "model/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "model/batch_normalization/FusedBatchNorm/Mul", "op": "Mul", "input": ["model/ExpandDims", "model/batch_normalization/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization/FusedBatchNorm", "op": "Add", "input": ["model/batch_normalization/FusedBatchNorm/Mul", "model/batch_normalization/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/1CNN/Relu", "op": "_FusedConv2D", "input": ["model/batch_normalization/FusedBatchNorm", "1CNN/kernel", "1CNN/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "model/batch_normalization_1/FusedBatchNorm/Mul", "op": "Mul", "input": ["model/1CNN/Relu", "model/batch_normalization_1/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_1/FusedBatchNorm", "op": "Add", "input": ["model/batch_normalization_1/FusedBatchNorm/Mul", "model/batch_normalization_1/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_1/FusedBatchNorm"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "4", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/2CNN/Relu", "op": "_FusedConv2D", "input": ["model/max_pooling2d/MaxPool", "2CNN/kernel", "2CNN/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "model/batch_normalization_2/FusedBatchNorm/Mul", "op": "Mul", "input": ["model/2CNN/Relu", "model/batch_normalization_2/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_2/FusedBatchNorm", "op": "Add", "input": ["model/batch_normalization_2/FusedBatchNorm/Mul", "model/batch_normalization_2/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_2/FusedBatchNorm"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "model/3CNN/Relu", "op": "_FusedConv2D", "input": ["model/max_pooling2d_1/MaxPool", "3CNN/kernel", "3CNN/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model/batch_normalization_3/FusedBatchNorm/Mul", "op": "Mul", "input": ["model/3CNN/Relu", "model/batch_normalization_3/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_3/FusedBatchNorm", "op": "Add", "input": ["model/batch_normalization_3/FusedBatchNorm/Mul", "model/batch_normalization_3/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_3/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "model/4CNN/Relu", "op": "_FusedConv2D", "input": ["model/max_pooling2d_2/MaxPool", "4CNN/kernel", "4CNN/bias"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "model/batch_normalization_4/FusedBatchNorm/Mul", "op": "Mul", "input": ["model/4CNN/Relu", "model/batch_normalization_4/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_4/FusedBatchNorm", "op": "Add", "input": ["model/batch_normalization_4/FusedBatchNorm/Mul", "model/batch_normalization_4/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_4/FusedBatchNorm"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "model/5CNN/Relu", "op": "_FusedConv2D", "input": ["model/max_pooling2d_3/MaxPool", "5CNN/kernel", "5CNN/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/batch_normalization_5/FusedBatchNorm/Mul", "op": "Mul", "input": ["model/5CNN/Relu", "model/batch_normalization_5/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/batch_normalization_5/FusedBatchNorm", "op": "Add", "input": ["model/batch_normalization_5/FusedBatchNorm/Mul", "model/batch_normalization_5/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["model/batch_normalization_5/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "4", "4", "1"]}}, "ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "model/flatten/Shape", "op": "Shape", "input": ["model/max_pooling2d_4/MaxPool"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/flatten/strided_slice", "op": "StridedSlice", "input": ["model/flatten/Shape", "model/flatten/strided_slice/stack", "model/flatten/strided_slice/stack_1", "model/flatten/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "model/flatten/Reshape/shape", "op": "Pack", "input": ["model/flatten/strided_slice", "model/flatten/Reshape/shape/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "model/flatten/Reshape", "op": "Reshape", "input": ["model/max_pooling2d_4/MaxPool", "model/flatten/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["model/flatten/Reshape", "dense/kernel", "dense/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/Sigmoid", "op": "Sigmoid", "input": ["model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "model/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "1CNN/kernel", "shape": [3, 3, 1, 128], "dtype": "float32"}, {"name": "model/batch_normalization_1/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "1CNN/bias", "shape": [128], "dtype": "float32"}, {"name": "2CNN/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "2CNN/bias", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_1/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "3CNN/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "3CNN/bias", "shape": [128], "dtype": "float32"}, {"name": "4CNN/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "4CNN/bias", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization/FusedBatchNorm/Scaled", "shape": [1], "dtype": "float32"}, {"name": "5CNN/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "5CNN/bias", "shape": [128], "dtype": "float32"}, {"name": "model/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "model/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "model/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "dense/kernel", "shape": [256, 50], "dtype": "float32"}, {"name": "model/batch_normalization/FusedBatchNorm/Offset", "shape": [1], "dtype": "float32"}, {"name": "dense/bias", "shape": [50], "dtype": "float32"}, {"name": "model/batch_normalization_5/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_5/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_4/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_4/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_3/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_3/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_2/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "model/batch_normalization_2/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}]}]}